Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/БиблиотекаПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейСУО</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>Библиотека</name>
    <type>
      <types>CatalogRef.КаталогМероприятийСУО</types>
      <types>CatalogRef.СхемыМероприятийСУО</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/БиблиотекаПользователейМеткиРесурсовСУО/БиблиотекаПользователейМеткиРесурсовСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>БиблиотекаПользователейМеткиРесурсовСУО</name>
  <attributes>
    <name>Метка</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ресурс</name>
    <type>
      <types>CatalogRef.ЛитератураСУО</types>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
      <types>CatalogRef.ЗаданияСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеКнигиСУО</types>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/InformationRegisters/ДанныеВебКабинетаСУО_ПН/ДанныеВебКабинетаСУО_ПН.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДанныеВебКабинетаСУО_ПН</name>
  <attributes>
    <name>Данные</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Формат</name>
    <type>
      <types>EnumRef.ФорматыВебДанныхСУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыДанныхВебКабинетаСУО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>DocumentRef</types>
      <types>EnumRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Examinator/src/Enums/СтатусыПроцессаОбученияСУО/СтатусыПроцессаОбученияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыПроцессаОбученияСУО</name>
  <enumValues>
    <name>Запланировано</name>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
  <enumValues>
    <name>НеДопущен</name>
  </enumValues>
  <enumValues>
    <name>Активно</name>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
  </enumValues>
  <enumValues>
    <name>ВозвращеноНаДоработку</name>
  </enumValues>
  <enumValues>
    <name>Окончено</name>
  </enumValues>
  <enumValues>
    <name>ОконченоБезПроверки</name>
  </enumValues>
  <enumValues>
    <name>ОконченоАвтоматом</name>
  </enumValues>
  <enumValues>
    <name>НеОкончено</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыДанныхВебКабинетаСУО/ТипыДанныхВебКабинетаСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыДанныхВебКабинетаСУО</name>
  <enumValues>
    <name>УчебнаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивность</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательскаяАктивностьОписание</name>
  </enumValues>
  <enumValues>
    <name>ВыполнениеЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаЗаданияОписание</name>
  </enumValues>
  <enumValues>
    <name>РезультатыТестирования</name>
  </enumValues>
  <enumValues>
    <name>УчастникОбучения</name>
  </enumValues>
  <enumValues>
    <name>ПреподавательОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеОбучения</name>
  </enumValues>
  <enumValues>
    <name>ОписаниеЗаявки</name>
  </enumValues>
  <enumValues>
    <name>РазделФорума</name>
  </enumValues>
  <enumValues>
    <name>РазделФорумаОписание</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщения</name>
  </enumValues>
  <enumValues>
    <name>ТемаОбщенияОписание</name>
  </enumValues>
  <enumValues>
    <name>Сообщение</name>
  </enumValues>
  <enumValues>
    <name>СообщениеОписание</name>
  </enumValues>
  <enumValues>
    <name>Организатор</name>
  </enumValues>
  <enumValues>
    <name>БиблиотекаПользователя</name>
  </enumValues>
  <enumValues>
    <name>Новость</name>
  </enumValues>
  <enumValues>
    <name>НовостьОписание</name>
  </enumValues>
  <enumValues>
    <name>КнигаОписание</name>
  </enumValues>
  <enumValues>
    <name>КаталогПользователей</name>
  </enumValues>
  <enumValues>
    <name>ПользовательОписание</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппа</name>
  </enumValues>
  <enumValues>
    <name>УчебнаяГруппаОписание</name>
  </enumValues>
  <enumValues>
    <name>ФайлУчащегося</name>
  </enumValues>
  <enumValues>
    <name>ПреподавателиПользователя</name>
  </enumValues>
  <enumValues>
    <name>Сертификат</name>
  </enumValues>
  <enumValues>
    <name>ОценкиКачестваОбучения</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ФорматыВебДанныхСУ/ФорматыВебДанныхСУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ФорматыВебДанныхСУ</name>
  <enumValues>
    <name>xml</name>
  </enumValues>
  <enumValues>
    <name>json</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Documents/НаполнениеБиблиотекиПользователейСУО/НаполнениеБиблиотекиПользователейСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>НаполнениеБиблиотекиПользователейСУО</name>
  <registerRecords>InformationRegister.БиблиотекаПользователейСУО</registerRecords>
  <attributes>
    <name>Примечание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Книги</name>
    <attributes>
      <name>Книга</name>
      <type>
        <types>CatalogRef.ЛитератураСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеКнигиСУО</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЭлектронныеРесурсы</name>
    <attributes>
      <name>ЭлектронныйРесурс</name>
      <type>
        <types>CatalogRef.СводыЗнанийСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>Фрагмент</name>
      <type>
        <types>CatalogRef.СодержаниеСУЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Файлы</name>
    <attributes>
      <name>Файл</name>
      <type>
        <types>CatalogRef.Файлы</types>
      </type>
    </attributes>
    <attributes>
      <name>МеткаВБиблиотеке</name>
      <type>
        <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>УчебныеГруппы</name>
    <attributes>
      <name>УчебнаяГруппа</name>
      <type>
        <types>CatalogRef.УчебныеГруппыСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Должности</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организации</name>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеОрганизации</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизацииСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПодразделенияПредприятия</name>
    <attributes>
      <name>ПодразделениеПредприятия</name>
      <type>
        <types>CatalogRef.ПодразделенияПредприятияСУО</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Организаторы</name>
    <comment>Заполняется в подписке УстановитьОтветственногоДокументаСУО</comment>
    <attributes>
      <name>Организатор</name>
      <type>
        <types>CatalogRef.ОрганизаторыСУО</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Examinator/src/Catalogs/ЗаданияСУО/ЗаданияСУО.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияСУО</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.КаталогМероприятийСУО</owners>
  <owners>Catalog.Пользователи</owners>
  <owners>Catalog.СхемыМероприятийСУО</owners>
  <attributes>
    <name>НаОсновеЭлектронногоРесурса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭлектронныйРесурс</name>
    <type>
      <types>CatalogRef.СводыЗнанийСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Фрагмент</name>
    <type>
      <types>CatalogRef.СодержаниеСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначимостьОценки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Продолжительность</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>120</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПродолжительностьВСекундах</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>32</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоСтраницВопросов</name>
    <comment>(используется для подборок в режиме тестирования)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоказыватьНавигацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПереходитьВпередАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПеремешиватьСтраницыВопросов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеквизитДопУпорядочивания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьСтандартныеНастройкиТеста</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеФорматированныйДокумент</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяФорматированныйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокВыполненияЗадания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НесколькоВариантов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобавитьВБиблиотеку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МеткаВБиблиотеке</name>
    <type>
      <types>CatalogRef.СтруктураБиблиотекиПользователейСУО</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьДополнительныеМатериалы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МетодВыбораПопыткиПрохождения</name>
    <type>
      <types>EnumRef.МетодВыбораПопыткиПрохожденияСУЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПреподавательВыставляетОценку</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьПрикреплениеФайлаКОтвету</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НеЖдатьПроверки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

Examinator/src/InformationRegisters/БиблиотекаПользователейСУО/ManagerModule.bsl
#Если Сервер ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ВнешнееСоединение Тогда

// ОБЩЕЕ	
	
Процедура БиблиотекаПользователейЗаполнитьДвижения(Движения, Знач Пользователь, Знач Период, Знач ВыборкаРесурсов, Знач СтатусПроцессаОбучения, Знач СтатусПроведения, Знач ЭтоУченик) Экспорт
	
	ВыборкаРесурсов.Сбросить();
	
	Пока ВыборкаРесурсов.Следующий() Цикл
		
		Если НЕ ВыборкаРесурсов.ДобавитьВБиблиотеку Тогда
			Продолжить;	
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ВыборкаРесурсов.Ресурс) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтоУченик И ВыборкаРесурсов.ПоказатьПослеПрохождения 
			И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.Окончено
			И СтатусПроцессаОбучения <> Перечисления.СтатусыПроцессаОбученияСУО.ОконченоАвтоматом Тогда
			Продолжить;
		КонецЕсли;
		
		Если НЕ Документы.ПроведениеОбученияСУО.МожноПоказатьРесурсПроведения(
			СтатусПроведения,
			ВыборкаРесурсов.ПоказатьПриСтатусеЗапланировано,
            ВыборкаРесурсов.ПоказатьПриСтатусеАктивно,
		    ВыборкаРесурсов.ПоказатьПриСтатусеЗавершено) Тогда
			 
			Продолжить;
			 
		КонецЕсли;
		
		Если ЭтоУченик И ВыборкаРесурсов.СкрыватьОтУченика Тогда
			Продолжить;
		КонецЕсли;
		
		УжеЕстьДвижение = Ложь; 
		Для каждого СуществующееДвижение Из Движения.БиблиотекаПользователейСУО Цикл		
			Если СуществующееДвижение.Пользователь = Пользователь
				И СуществующееДвижение.Ресурс = ВыборкаРесурсов.Ресурс Тогда
				УжеЕстьДвижение = Истина;
				Прервать;
			КонецЕсли;		
		КонецЦикла;
		
		Если УжеЕстьДвижение Тогда
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.БиблиотекаПользователейСУО.Добавить();
		
		Движение.Пользователь = Пользователь;
		Движение.Ресурс       = ВыборкаРесурсов.Ресурс;
		Движение.Фрагмент     = ВыборкаРесурсов.Фрагмент;		
		Движение.Метка        = ВыборкаРесурсов.МеткаВБиблиотеке;
		
		Если ЗначениеЗаполнено(ВыборкаРесурсов.ДатаИзменения)
			И ВыборкаРесурсов.ДатаИзменения > Период Тогда
			
			Движение.Период = ВыборкаРесурсов.ДатаИзменения;
			
		Иначе
			
			Движение.Период = Период;
			
		КонецЕсли;		
		
		Если ЗначениеЗаполнено(Движение.Метка) Тогда
			Движение.Библиотека = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Движение.Метка, "Владелец");
		Иначе
			Движение.Библиотека = Справочники.СхемыМероприятийСУО.Общая;
		КонецЕсли;					
	
	КонецЦикла;
	
КонецПроцедуры

Функция БиблиотекиПользователя(Пользователь)
	
	МассивБиблиотек = Новый Массив;
	
	МассивБиблиотек.Добавить(Справочники.СхемыМероприятийСУО.Общая);
	
	Если ДоступнаБиблиотекаПользователя(Пользователь) Тогда
		МассивБиблиотек.Добавить(Пользователь);	
	КонецЕсли;
	
	ВыборкаБиблиотек = РегистрыСведений.БиблиотекаПользователейСУО.ВыборкаБиблиотекПользователя(Пользователь);
	
	Пока ВыборкаБиблиотек.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаБиблиотек.ВладелецМетки)
			И МассивБиблиотек.Найти(ВыборкаБиблиотек.ВладелецМетки) = Неопределено Тогда
			
			МассивБиблиотек.Добавить(ВыборкаБиблиотек.ВладелецМетки);
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат МассивБиблиотек;
	
КонецФункции

Функция ДоступнаБиблиотекаПользователя(Пользователь) Экспорт
	
	ДоступнаМояБиблиотека = Ложь;
	
	// Определяем, доступна ли моя библиотека

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СтруктураБиблиотекиПользователейСУО.Ссылка
		|ИЗ
		|	Справочник.СтруктураБиблиотекиПользователейСУО КАК СтруктураБиблиотекиПользователейСУО
		|ГДЕ
		|	СтруктураБиблиотекиПользователейСУО.Владелец = &Пользователь
		|	И СтруктураБиблиотекиПользователейСУО.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Если НЕ Результат.Пустой() Тогда
		ДоступнаМояБиблиотека = Истина;	
	КонецЕсли;
	
	Если НЕ ДоступнаМояБиблиотека Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	БиблиотекаПользователейМеткиРесурсовСУО.Метка
			|ИЗ
			|	РегистрСведений.БиблиотекаПользователейМеткиРесурсовСУО КАК БиблиотекаПользователейМеткиРесурсовСУО
			|ГДЕ
			|	БиблиотекаПользователейМеткиРесурсовСУО.Пользователь = &Пользователь";

		Запрос.УстановитьПараметр("Пользователь", Пользователь);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
			ДоступнаМояБиблиотека = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
	Если НЕ ДоступнаМояБиблиотека Тогда

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	БиблиотекаПользователейСУО.Регистратор
			|ИЗ
			|	РегистрСведений.БиблиотекаПользователейСУО КАК БиблиотекаПользователейСУО
			|ГДЕ
			|	БиблиотекаПользователейСУО.Библиотека = &Пользователь";

		Запрос.УстановитьПараметр("Пользователь", Пользователь);

		Результат = Запрос.Выполнить();

		Если НЕ Результат.Пустой() Тогда
			ДоступнаМояБиблиотека = Истина;
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ДоступнаМояБиблиотека;
	
КонецФункции

Функция ПользователиРегистратора(Регистратор) Экспорт
	
	Возврат Документы.НаполнениеБиблиотекиПользователейСУО.ПользователиДокумента(Регистратор);
	
КонецФункции

Функция РесурсДоступенПользователю(Пользователь, Ресурс) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БиблиотекаПользователейСУО.Регистратор
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейСУО КАК БиблиотекаПользователейСУО
		|ГДЕ
		|	БиблиотекаПользователейСУО.Пользователь = &Пользователь
		|	И БиблиотекаПользователейСУО.Ресурс = &Ресурс";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Ресурс", Ресурс);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат НЕ РезультатЗапроса.Пустой();
	
КонецФункции

Функция ВыборкаБиблиотекПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БиблиотекаПользователейСУОСрезПоследних.Библиотека КАК ВладелецМетки,
		|	БиблиотекаПользователейСУОСрезПоследних.Библиотека.Наименование КАК Наименование
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейСУО.СрезПоследних(, Пользователь = &Пользователь) КАК БиблиотекаПользователейСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	БиблиотекаПользователейСУОСрезПоследних.Библиотека.Предопределенный УБЫВ";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();

	Возврат Результат.Выбрать();	
	
КонецФункции

Функция РесурсыБиблиотекиПользователя() Экспорт
	
КонецФункции

Функция ВыборкаЭлементовБиблиотекиПользователя(Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БиблиотекаПользователейСУОСрезПоследних.Период КАК ДатаДобавления,
		|	БиблиотекаПользователейСУОСрезПоследних.Ресурс,
		|	БиблиотекаПользователейСУОСрезПоследних.Фрагмент,
		|	БиблиотекаПользователейСУОСрезПоследних.Метка,
		|	БиблиотекаПользователейСУОСрезПоследних.Библиотека,
		|	ВЫБОР
		|		КОГДА (ВЫРАЗИТЬ(БиблиотекаПользователейСУОСрезПоследних.Ресурс КАК Справочник.ЗаданияСУО)) <> ЗНАЧЕНИЕ(Справочник.ЗаданияСУО.ПустаяСсылка)
		|				ИЛИ (ВЫРАЗИТЬ(БиблиотекаПользователейСУОСрезПоследних.Ресурс КАК Справочник.Файлы)) <> ЗНАЧЕНИЕ(Справочник.Файлы.ПустаяСсылка)
		|			ТОГДА БиблиотекаПользователейСУОСрезПоследних.Ресурс.Наименование
		|		ИНАЧЕ ВЫБОР
		|				КОГДА (ВЫРАЗИТЬ(БиблиотекаПользователейСУОСрезПоследних.Фрагмент КАК Справочник.СодержаниеСУЗ)) = ЗНАЧЕНИЕ(Справочник.СодержаниеСУЗ.ПустаяСсылка)
		|						ИЛИ (ВЫРАЗИТЬ(БиблиотекаПользователейСУОСрезПоследних.Фрагмент КАК Справочник.СодержаниеКнигиСУО)) = ЗНАЧЕНИЕ(Справочник.СодержаниеКнигиСУО.ПустаяСсылка)
		|					ТОГДА БиблиотекаПользователейСУОСрезПоследних.Ресурс.Наименование
		|				ИНАЧЕ БиблиотекаПользователейСУОСрезПоследних.Фрагмент.Наименование
		|			КОНЕЦ
		|	КОНЕЦ КАК Наименование,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БиблиотекаПользователейСУОСрезПоследних.Ресурс) = ТИП(Справочник.Файлы)
		|			ТОГДА БиблиотекаПользователейСУОСрезПоследних.Ресурс.Расширение
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК Расширение,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(БиблиотекаПользователейСУОСрезПоследних.Ресурс) = ТИП(Справочник.СводыЗнанийСУЗ)
		|			ТОГДА 1
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Картинка
		|ИЗ
		|	РегистрСведений.БиблиотекаПользователейСУО.СрезПоследних(, Пользователь = &Пользователь) КАК БиблиотекаПользователейСУОСрезПоследних
		|
		|УПОРЯДОЧИТЬ ПО
		|	Наименование";

	Запрос.УстановитьПараметр("Пользователь", Пользователь);

	Результат = Запрос.Выполнить();
	
	Возврат Результат.Выбрать();
	
КонецФункции

Функция РесурсДляДобавления(ВыборкаДетальныеЗаписи, ТаблицаПользовательскихМеток, ТекущаяБиблиотека, ТекущаяМетка, Пользователь) Экспорт
	
	РесурсДляДобавления = Ложь;
	
	Если ТекущаяБиблиотека = Пользователь Тогда
		
		Если ТаблицаПользовательскихМеток.НайтиСтроки(Новый Структура("Ресурс, Фрагмент, Метка", ВыборкаДетальныеЗаписи.Ресурс, ВыборкаДетальныеЗаписи.Фрагмент, ТекущаяМетка)).Количество() > 0 Тогда
			
			РесурсДляДобавления = Истина; // Ресурс помещен в пользовательскую библиотеку самим пользователем
			
		КонецЕсли;
		
		Если ВыборкаДетальныеЗаписи.Метка = ТекущаяМетка
			И ТаблицаПользовательскихМеток.НайтиСтроки(Новый Структура("Ресурс, Фрагмент", ВыборкаДетальныеЗаписи.Ресурс, ВыборкаДетальныеЗаписи.Фрагмент)).Количество() = 0
			И (ВыборкаДетальныеЗаписи.Библиотека = Неопределено
			ИЛИ ВыборкаДетальныеЗаписи.Библиотека = Пользователь) Тогда
			
			РесурсДляДобавления = Истина; // Ресурс явно помещен в пользовательскую библиотеку без пользовательской метки
			
		КонецЕсли;
		
	Иначе
		
		Если ВыборкаДетальныеЗаписи.Метка = ТекущаяМетка
			И ВыборкаДетальныеЗаписи.Библиотека = ТекущаяБиблиотека Тогда
			
			РесурсДляДобавления = Истина; 
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат РесурсДляДобавления;
	
КонецФункции

// ВЕБ-КАБИНЕТ

Процедура ОбновитьДанныеВебКабинета(Пользователь, ДополнительныеДанные = Неопределено) Экспорт
	
	// Данная процедура вызывается из других процедур обновления данных (не самостоятельно),
	// Кроме случая отработки зависимости.
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеБиблиотекПользователя = Новый Массив;
	Зависимости = Новый Массив;	
	
	// Получаем данные
	//
	
	Библиотеки = БиблиотекиПользователя(Пользователь);
	ТаблицаПользовательскихМеток = РегистрыСведений.БиблиотекаПользователейМеткиРесурсовСУО.ТаблицаПользовательскихМеток(Пользователь);
	ВыборкаЭлементов = РегистрыСведений.БиблиотекаПользователейСУО.ВыборкаЭлементовБиблиотекиПользователя(Пользователь);
	
	Для каждого Библиотека Из Библиотеки Цикл
	
		СтруктураБиблиотеки = Новый Структура("Идентификатор, Наименование, Тип, Метки, Ресурсы");					
		СтруктураБиблиотеки.Идентификатор = Строка(Библиотека.УникальныйИдентификатор());
		СтруктураБиблиотеки.Наименование  = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Библиотека, "Наименование");
		СтруктураБиблиотеки.Тип           = Библиотека.Метаданные().Имя;
		
		ДеревоМеток = Новый ДеревоЗначений;
		ДеревоМеток.Колонки.Добавить("Ссылка");
		ДеревоМеток.Колонки.Добавить("Порядок");
		ДеревоМеток.Колонки.Добавить("Наименование");
		ДеревоМеток.Колонки.Добавить("Ресурсы");
		
		Справочники.СтруктураБиблиотекиПользователейСУО.ЗаполнитьДеревоМеток(ДеревоМеток, Библиотека, Пользователь);
		
		ДобавитьРесурсыВДеревоМеток(ДеревоМеток.Строки, ТаблицаПользовательскихМеток, ВыборкаЭлементов, Библиотека, Пользователь, Зависимости);
		
		СтруктураБиблиотеки.Метки = ДеревоМеток;
		
		СтруктураБиблиотеки.Ресурсы = Новый Массив; // Для совместимости
				
		ДанныеБиблиотекПользователя.Добавить(СтруктураБиблиотеки);
		
	КонецЦикла;
	
	// Записываем данные
	//
	
	РегистрыСведений.ДанныеВебКабинетаСУО_ПН.ДобавитьДанные(
		Пользователь,
		Перечисления.ТипыДанныхВебКабинетаСУО.БиблиотекаПользователя,
		Пользователь,
		ОбщегоНазначенияСУ.ДанныеВJSON(ДанныеБиблиотекПользователя),
		Перечисления.ФорматыВебДанныхСУ.json);	
		
	// Записываем зависимости	
	//
	
	РегистрыСведений.ЗависимостиДанныхВебКабинетаСУ.ДобавитьДанные(Пользователь, "РегистрСведений.БиблиотекаПользователейСУО", Зависимости);	
	
КонецПроцедуры

Процедура ДобавитьРесурсыВДеревоМеток(СтрокиДерева, ТаблицаПользовательскихМеток, ВыборкаЭлементов, Библиотека, Пользователь, Зависимости)
	
	Для каждого Строка Из СтрокиДерева Цикл
		
		Строка.Ресурсы = Новый Массив;
		
		ВыборкаЭлементов.Сбросить();
		
		Пока ВыборкаЭлементов.Следующий() Цикл
			
			Если РегистрыСведений.БиблиотекаПользователейСУО.РесурсДляДобавления(
				ВыборкаЭлементов, ТаблицаПользовательскихМеток, Библиотека, Строка.Ссылка, Пользователь) Тогда				
				ДобавитьРесурсВДеревоМеток(ВыборкаЭлементов, Зависимости, Строка);					
			КонецЕсли;
			
		КонецЦикла;
		
		ДобавитьРесурсыВДеревоМеток(Строка.Строки, ТаблицаПользовательскихМеток, ВыборкаЭлементов, Библиотека, Пользователь, Зависимости); // Рекурсия
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавитьРесурсВДеревоМеток(СвойствоЭлемента, Зависимости, СтрокаМеток) 
	
	ОписаниеРесурса = Новый Структура("Наименование, Фрагмент, Ресурс, ДатаДобавления, Тип, Расширение");
	ЗаполнитьЗначенияСвойств(ОписаниеРесурса, СвойствоЭлемента);
	
	Если ТипЗнч(СвойствоЭлемента.Ресурс) = Тип("СправочникСсылка.СводыЗнанийСУЗ") Тогда
		ОписаниеРесурса.Тип = "res";
	КонецЕсли;
	
	Если ТипЗнч(СвойствоЭлемента.Ресурс) = Тип("СправочникСсылка.ЛитератураСУО") Тогда
		ОписаниеРесурса.Тип = "book";
	КонецЕсли;
	
	Если ТипЗнч(СвойствоЭлемента.Ресурс) = Тип("СправочникСсылка.Файлы") Тогда
		ОписаниеРесурса.Тип = "file";
	КонецЕсли;
	
	СтрокаМеток.Ресурсы.Добавить(ОписаниеРесурса);
	
	Зависимости.Добавить(ОписаниеРесурса.Ресурс);	
	
КонецПроцедуры

#КонецЕсли
